LEXICON: dict[str, str] = {
    "/start": "<b>Привет, репетитор!</b>\n\nЭто бот, в котором "
              'ты можешь есть все необходимое для тебя"\n\nЧтобы посмотреть список доступных '
              "команд - набери /help",
    "/help": "<b>Меню:\n/start - Начать работу с ботом, и загрузить базу данных\n"
             "/prices - Посмотреть или изменить цены за занятия с ученикам\n"
             "/schedule - Посмотреть или изменить расписание\n"
             "/earnings - Внести выручку за определенную дату"
             "</b>",
    "cancel": "Отмена",
    "/schedule": "Расписание",
    "/prices": "Цены за занятие",
    "change schedule": "Изменить расписание",
    "see the schedule": "Посмотреть расписание",
    "Monday": "Понедельник",
    "Tuesday": "Вторник",
    "Wednesday": "Среда",
    "Thursday": "Четверг",
    "Friday": "Пятница",
    "Saturday": "Суббота",
    "Sunday": "Воскресенье",
    "add_student": "Изменить день",
    "change prices": "Изменить цены",
    "see the prices": "Посмотреть цены",
    "today": "Сегодня",
    "yesterday": "Вчера",
    "another date": "Другая дата",
}

LEXICON_COMMANDS: dict[str, str] = {
    "/start": "Начать",
    "/help": "Меню",
    "/schedule": "Расписание",
    "/prices": "Цены за занятие",
    "/earnings": "Внести выручку",
}
