from pymongo.mongo_client import MongoClient
from config_data.config import Config, load_config

# Загружаем конфиг в переменную config
config: Config = load_config()
# Подключаемся к базе данных MongoDB
client = MongoClient(config.tg_bot.url)

collection = client["user_bd"]["user"]
collection.update_one(
    {"id": 5222335152},
    {"$set": {'data': {
        "schedule": {
            "Понедельник": {
                "Варя Барбарина": "17:00",
                "Захар Прилепин": "18:30",
                "Гоша Пупкин": "20:00"
            },
            "Вторник": {
                "Анна Казакова": "17:30",
                "Гоша Пупкин": "19:00"
            },
            "Среда": {
                "Костя Машинов": "9:00",
                "Катя Пятова": "15:30",
                "Варвара Барбарина": "17:00",
                "Даша Саратова": "19:00",
                "Гоша Пупкин": "20:00"
            },
            "Четверг": {
                "Анна Казакова": "17:30",
                "Захар Прилепин": "18:40",
                "Нина Суисайдова": "20:00"
            },
            "Пятница": {
                "Костя Машинов": "9:00",
                "Катя Одинокая": "20:00"
            },
            "Суббота": {
                "Анна Казакова": "11:00",
                "Нина Суисайдова": "12:15",
                "Гоша Пупкин": "13:30"
            },
            "Воскресенье": {
                "Катя": "12:00",
                "Гоша Пупкин": "13:30"
            }
        },
        "price_per_lesson": {
            "Гоша Пупкин": 600,
            "Захар Прилепин": 400,
            "Варвара Барбарина": 600,
            "Катя Одинокая": 600,
            "Катя Пятова": 500,
            "Анна Казакова": 600,
            "Нина Суисайдова": 600,
            "Даша Саратова": 500,
            "Костя Машинов": 500
        }
    }}},
)
