# Словарь для расписания


schedule = {
    "Понедельник": {"Имя Фамилия": "10:00", "Имя Фамилия 2": "8:00"},
    "Вторник": {"Имя Фамилия": "10:00"},
    "Среда": {"Имя Фамилия": "10:00"},
    "Четверг": {"Имя Фамилия": "10:00"},
    "Пятница": {"Имя Фамилия": "10:00"},
    "Суббота": {"Имя Фамилия": "10:00"},
    "Воскресенье": {"Имя Фамилия": "10:00"},
}

# Словарь для цены за занятие для каждого ученика
price_per_lesson = {
    "Имя Фамилия": 400,
    "Имя Фамилия 2": 500,
    "Имя Фамилия 3": 600,
}

week_days = {
    0: 'Понедельник',
    1: 'Вторник',
    2: 'Среда',
    3: 'Четверг',
    4: 'Пятница',
    5: 'Суббота',
    6: 'Воскресенье'
}
